Revit 2027 API
SunStudyTimeInterval Enumeration
 Time interval enum for a single or multi-day sun study.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SunStudyTimeInterval
Public Enumeration SunStudyTimeInterval
public enum class SunStudyTimeInterval
type SunStudyTimeInterval
Members
Member name | Value | Description
Day | 4 |  Interval occurs every day.
Hour | 3 |  Interval occurs every hour.
Minute | -1 |  Interval occurs every minute.
Minutes15 | 0 |  Interval occurs every 15 minutes.
Minutes30 | 1 |  Interval occurs every 30 minutes.
Minutes45 | 2 |  Interval occurs every 45 minutes.
Month | 6 |  Interval occurs once a month.
Seconds15 | -4 |  Interval occurs every 15 seconds.
Seconds30 | -3 |  Interval occurs every 30 seconds.
Seconds45 | -2 |  Interval occurs every 45 seconds.
Week | 5 |  Interval occurs once a week.
See Also
Reference
Autodesk.Revit.DB Namespace